<h1>Proyecto Final de Master</h1>

<h2>Importación de librerias necesarias para el proyecto</h2>
<p>Empezamos importando cada una de las librerias necesarisa para que el proyecto se pueda ejecutar de manera eficiente</p>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.style as style
from datetime import datetime
import mysql.connector
from sqlalchemy import create_engine

/var/folders/qp/15r6t82j457fsqn4ys0brpmh0000gp/T/ipykernel_98894/649646696.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

<h3>Iniciar conexion a la base de datos</h3>
<p>Creamos la conexión a la base de datos, y habilitamos para poder leer y escribir datos en la base de datos.</p>

In [ ]:
query_test = "SELECT * FROM TEST"
db_name = "tfm_alex"
pswrd = ""
ssl_ca = './cert.pem'
dialect = 'mysql'
username = 'inesdiadmin'
password = pswrd
host = 'inesditfm.mysql.database.azure.com'
port = 3306
database = db_name
ssl_ca = ssl_ca
sql_connection_string = f"{dialect}+{username}:{password}@{host}:{port}/{database}?ssl_ca={ssl_ca}"

conn = create_engine(f"mysql+mysqlconnector://inesdiadmin:{pswrd}@inesditfm.mysql.database.azure.com:3306/{db_name}?ssl_ca={ssl_ca}")
try:
    if conn:
        cursor = conn.connect()
        print("conexion exitosa")
except Exception as ex:
    print(ex)
finally:
    cursor.close()

In [ ]:
%load_ext sql

In [ ]:
%sql {f"mysql+mysqlconnector://inesdiadmin:{pswrd}@inesditfm.mysql.database.azure.com:3306/{db_name}?ssl_ca={ssl_ca}"}

<h3>1. Hacemos la carga de los datos de Amazon Sales csv</h3>
<p>Aqui leemos el archivo CSV para poder cargar los datos, limpiarlos y subirlos a la base de datos.</p>

In [2]:
amazon_original = pd.read_csv("./Data Set/amazon_final.csv")
amazon_original.head()

,index,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,...,Courier Status,Qty,currency,Amount,ship-state,ship-postal-code,ship-country,B2B,fulfilled-by,sub-status
0,0,405-8078784-5731545,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,...,NaN,0,INR,647.62,MAHARASHTRA,400081.0,IN,False,Easy Ship,NaN
1,1,171-9198151-1101146,2022-04-30,Shipped,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,...,Shipped,1,INR,406.00,KARNATAKA,560085.0,IN,False,Easy Ship,Delivered to Buyer
2,2,404-0687676-7273146,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,...,Shipped,1,INR,329.00,MAHARASHTRA,410210.0,IN,True,NaN,NaN
3,3,403-9615377-8133951,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,J0341,J0341-DR-L,Western Dress,...,NaN,0,INR,753.33,PUDUCHERRY,605008.0,IN,False,Easy Ship,NaN
4,4,407-1069790-7240320,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3671,JNE3671-TU-XXXL,Top,...,Shipped,1,INR,574.00,TAMIL NADU,600073.0,IN,False,NaN,NaN

<h3>Visualizamos los nombres de columnas</h3>
<p>Luego de la importacion de los archivos procedemos a revisar que información contiene cada columna.</p>

In [4]:
amazon_original.columns

Index(['index', 'Order ID', 'Date', 'Status', 'Fulfilment', 'Sales Channel ',
       'ship-service-level', 'Style', 'SKU', 'Category', 'Size', 'ASIN',
       'Courier Status', 'Qty', 'currency', 'Amount', 'ship-state',
       'ship-postal-code', 'ship-country', 'B2B', 'fulfilled-by',
       'sub-status'],
      dtype='object')

<h3>Mostramos la cantidad de datos</h3>

In [5]:
amazon_original.shape

(128975, 22)

<h4>Eliminamos las filas duplicadas ...</h4>
<p>Estamos limpiando los valores nulos y duplicados, del mismo modo visualizamos cuantos datos nos quedan.</p>

In [6]:
amazon_clean= amazon_original.fillna(np.nan)
amazon_clean = amazon_original.drop_duplicates()
amazon_clean.shape

(128975, 22)

<h3>Renombramos las columnas</h3>
<p>En este punto renombramos los datos a nombres mas claros para que podamos tener la informacion mas clara.</p>

In [7]:

amazon_clean.rename(columns={'Order ID':'order_id','Status':'estado', 'Sales Channel ':'Sales_channel','ship-service-level':'ship_service_level','ship-state':'ship_state','ship-postal-code':'ship_postal_code','ship-country':'ship_country','fulfilled-by':'fulfilled_by','sub-status':'sub_status','Courier Status':'Courier_Status'}, inplace=True)

<h3>Vemos el estado de los datos actuales</h3>
<p>Visualizamos los datos que finalmente quedaran listos para ingresarlos a la base de datos.</p>

In [8]:
amazon_clean.head()

,index,order_id,Date,estado,Fulfilment,Sales_channel,ship_service_level,Style,SKU,Category,...,Courier_Status,Qty,currency,Amount,ship_state,ship_postal_code,ship_country,B2B,fulfilled_by,sub_status
0,0,405-8078784-5731545,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,...,NaN,0,INR,647.62,MAHARASHTRA,400081.0,IN,False,Easy Ship,NaN
1,1,171-9198151-1101146,2022-04-30,Shipped,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,...,Shipped,1,INR,406.00,KARNATAKA,560085.0,IN,False,Easy Ship,Delivered to Buyer
2,2,404-0687676-7273146,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,...,Shipped,1,INR,329.00,MAHARASHTRA,410210.0,IN,True,NaN,NaN
3,3,403-9615377-8133951,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,J0341,J0341-DR-L,Western Dress,...,NaN,0,INR,753.33,PUDUCHERRY,605008.0,IN,False,Easy Ship,NaN
4,4,407-1069790-7240320,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3671,JNE3671-TU-XXXL,Top,...,Shipped,1,INR,574.00,TAMIL NADU,600073.0,IN,False,NaN,NaN

<h3>Creamos la tabla AMAZON_SALES_REPORT</h3>
<p>Hacemos la creación e ingreso de datos para esta tabla.</p>

In [ ]:

amazon_clean.to_sql(name='AMAZON_SALES_REPORT',con=conn,if_exists = 'append', index=False)
print('Se ingresaron todos los datos del CSV Amazon Sales.....')

<h3>Se hace una revisión si existe y se ingresaron correctamente los datos. </h3>

In [12]:
%sql select * from AMAZON_SALES_REPORT limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[(0, '405-8078784-5731545', '2022-04-30', 'Cancelled', 'Merchant', 'Amazon.in', 'Standard', 'SET389', 'SET389-KR-NP-S', 'Set', 'S', 'B09KXVBD7Z', None, 0, 'INR', 647.62, 'MAHARASHTRA', 400081.0, 'IN', 0, 'Easy Ship', None),
 (1, '171-9198151-1101146', '2022-04-30', 'Shipped', 'Merchant', 'Amazon.in', 'Standard', 'JNE3781', 'JNE3781-KR-XXXL', 'kurta', '3XL', 'B09K3WFS32', 'Shipped', 1, 'INR', 406.0, 'KARNATAKA', 560085.0, 'IN', 0, 'Easy Ship', 'Delivered to Buyer'),
 (2, '404-0687676-7273146', '2022-04-30', 'Shipped', 'Amazon', 'Amazon.in', 'Expedited', 'JNE3371', 'JNE3371-KR-XL', 'kurta', 'XL', 'B07WV4JV4D', 'Shipped', 1, 'INR', 329.0, 'MAHARASHTRA', 410210.0, 'IN', 1, None, None),
 (3, '403-9615377-8133951', '2022-04-30', 'Cancelled', 'Merchant', 'Amazon.in', 'Standard', 'J0341', 'J0341-DR-L', 'Western Dress', 'L', 'B099NRCT7B', None, 0, 'INR', 753.33, 'PUDUCHERRY', 605008.0, 'IN', 0, 'Easy Ship', None),
 (4, '407-1069790-7240320', '2022-04-30', 'Shipped', 'Amazon', 'Amazon.in', 'Expedited', 'JNE3671', 'JNE3671-TU-XXXL', 'Top', '3XL', 'B098714BZP', 'Shipped', 1, 'INR', 574.0, 'TAMIL NADU', 600073.0, 'IN', 0, None, None)]

<h3>2. Proceso de carga International Sale Report</h3>
<p>Se carga el archivo csv de international limpio</p>

In [17]:
international = pd.read_csv("./Data Set/02 International sale Report_1_clean.csv")
international.head()

,index,DATE,Months,CUSTOMER,Style,SKU,Size,PCS,RATE,GROSS AMT
0,0,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-L,L,1.0,616.56,617.0
1,1,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XL,XL,1.0,616.56,617.0
2,2,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XXL,XXL,1.0,616.56,617.0
3,3,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5009,MEN5009-KR-L,L,1.0,616.56,617.0
4,4,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5011,MEN5011-KR-L,L,1.0,616.56,617.0

<p>Actualizamos el formato del campo Date para tenerlo mas limpio</p>

In [18]:
international['DATE'] = pd.to_datetime(international['DATE'])
international.dtypes

index                 int64
DATE         datetime64[ns]
Months               object
CUSTOMER             object
Style                object
SKU                  object
Size                 object
PCS                 float64
RATE                float64
GROSS AMT           float64
dtype: object

<p>Renombramos los nombres de las columnas para poder tener mas claridad y orden de estos.</p>

In [ ]:
international.rename(columns={'index': 'id','DATE':'fecha','Months':'mes','CUSTOMER':'cliente','SKU':'sku_codigo','PCS':'cantidad','RATE':'precio','GROSS AMT':'precio_bruto'}, inplace=True)

<p>Visualizamos la informacion del contenido del archivo Sales report</p>

In [19]:
international.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17218 entries, 0 to 17217
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      17218 non-null  int64
 1   DATE       17218 non-null  datetime64[ns]
 2   Months     17218 non-null  object
 3   CUSTOMER   17218 non-null  object
 4   Style      17218 non-null  object
 5   SKU        17218 non-null  object
 6   Size       17218 non-null  object
 7   PCS        17218 non-null  float64
 8   RATE       17218 non-null  float64
 9   GROSS AMT  17218 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 1.3+ MB

<h3>Creamos la tabla correspondiente para poder ingresar los datos.</h3>

In [20]:
%sql CREATE TABLE `international_sale_report` (	`id` INT(11) NOT NULL DEFAULT '0',	`fecha` DATETIME NULL DEFAULT NULL,	`cliente` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_bin',	`sku_codigo` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_bin',	`cantidad` DECIMAL(10,0) NULL DEFAULT NULL,	`precio` DECIMAL(10,0) NULL DEFAULT NULL,	`precio_bruto` DECIMAL(10,0) NULL DEFAULT NULL,	PRIMARY KEY (`id`) USING BTREE)

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<p>Visualizamos que se creo la tabla correctamente</p>

In [21]:
%sql select * from international_sale_report limit 1

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<h3>Hacemos el ingreso de datos para que podamos tener los datos en la tabla correspondiente, international_sale_report</h3>

In [23]:
international[['id','fecha','cliente','sku_codigo','cantidad','precio','precio_bruto']].to_sql('international_sale_report', con = conn, if_exists = 'append', index=False)

17218

<p>Visualizamos las 5 primeras filas para poder ver que se ingresaron correctamente los datos. </p>

In [24]:
%sql select * from international_sale_report limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[(0, datetime.datetime(2021, 6, 5, 0, 0), 'REVATHY LOGANATHAN', 'MEN5004-KR-L', Decimal('1'), Decimal('617'), Decimal('617')),
 (1, datetime.datetime(2021, 6, 5, 0, 0), 'REVATHY LOGANATHAN', 'MEN5004-KR-XL', Decimal('1'), Decimal('617'), Decimal('617')),
 (2, datetime.datetime(2021, 6, 5, 0, 0), 'REVATHY LOGANATHAN', 'MEN5004-KR-XXL', Decimal('1'), Decimal('617'), Decimal('617')),
 (3, datetime.datetime(2021, 6, 5, 0, 0), 'REVATHY LOGANATHAN', 'MEN5009-KR-L', Decimal('1'), Decimal('617'), Decimal('617')),
 (4, datetime.datetime(2021, 6, 5, 0, 0), 'REVATHY LOGANATHAN', 'MEN5011-KR-L', Decimal('1'), Decimal('617'), Decimal('617'))]

## 3. Proceso de carga STOCK

In [25]:
stock = pd.read_csv("./Data Set/02 International sale Report_2_Stock.csv")
stock.head()

              SKU    Style Size  Stock
0    MEN5004-KR-L  MEN5004    L    8.0
1   MEN5004-KR-XL  MEN5004   XL    4.0
2  MEN5004-KR-XXL  MEN5004  XXL    6.0
3    MEN5009-KR-L  MEN5009    L    6.0
4    MEN5011-KR-L  MEN5011    L   11.0

<p>Visualizamos la cantidad de datos del archivo International - Stock </p>

In [26]:
stock.shape

(4599, 4)

<p>Retiramos columnas que no se utilizaran para el ingreso de datos la DB</p>

In [27]:
stock.drop(['Style','Size'],axis = 'columns', inplace=True)

<p>Eliminamos duplicados para evitar tener problemas</p>

In [28]:
stock = stock.drop_duplicates()
stock.shape

(4597, 2)

<h3>Hacemos el actualizado de los nombres de las columnas para poder ingresar los datos en limpio</h3>

In [ ]:
stock.rename(columns={'SKU':'sku_codigo','Stock':'cantidad'}, inplace=True)

<h3>Creamos la tabla para poder ingresar los datos</h3>

In [31]:
%sql CREATE TABLE `stock` (	`sku_codigo` CHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',	`cantidad` DECIMAL(10,0) NULL DEFAULT NULL,UNIQUE (`sku_codigo`) USING BTREE)

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<h3>Se hace un SELECT para poder visualizar datos y validar que la tabla se creo correctamente.</h3>

In [32]:
%sql select * from stock

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<h3>Ejecutamos la funcion para ingresar los datos y crear la tabla STOCK</h3>

In [34]:
stock[['sku_codigo','cantidad',]].to_sql('stock', con = conn, if_exists = 'append', index=False)

4597

<p>Hacemos un select para obtener los 5 primeros valores para y validar que los datos se ingresaron correctamente</p>

In [35]:
%sql select * from stock limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[('MEN5004-KR-L', Decimal('8')),
 ('MEN5004-KR-XL', Decimal('4')),
 ('MEN5004-KR-XXL', Decimal('6')),
 ('MEN5009-KR-L', Decimal('6')),
 ('MEN5011-KR-L', Decimal('11'))]

## 4. Cargar Marzo 2021

<p>Se carga el archivo en excel con los datos en limpio de March</p>

In [38]:
pl_marzo = pd.read_excel("./Data Set/P_L_MARCH_CLEAN.xlsx")
pl_marzo.head()

,index,Sku,Style Id,Catalog,Category,Weight,TP 1,TP 2,MRP Old,Final MRP Old,Ajio MRP,Amazon MRP,Amazon FBA MRP,Flipkart MRP,Limeroad MRP,Myntra MRP,Paytm MRP,Snapdeal MRP,Custom_Size
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,S
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,M
2,2,Os206_3141_L,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,L
3,3,Os206_3141_XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,XL
4,4,Os206_3141_2XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,2XL

<p>Visualizamos las columnas que contiene este documento</p>

In [39]:
pl_marzo.columns

Index(['index', 'Sku', 'Style Id', 'Catalog', 'Category', 'Weight', 'TP 1',
       'TP 2', 'MRP Old', 'Final MRP Old', 'Ajio MRP', 'Amazon MRP',
       'Amazon FBA MRP', 'Flipkart MRP', 'Limeroad MRP', 'Myntra MRP',
       'Paytm MRP', 'Snapdeal MRP', 'Custom_Size'],
      dtype='object')

<h3>Hacemos el actualizado del nombre de las columnas para poder tener los datos mas limpios y asi poder ingresar ala DB correctamente</h3>

In [40]:
pl_marzo.rename(columns={'index':'id','Style Id':'style', 'Category':'categoria', 'TP 1':'TP_1','TP 2':'TP_2', 'MRP Old':'MRP_Old', 'Final MRP Old':'Final_MRP_Old', 'Ajio MRP':'Ajio_MRP', 'Amazon MRP':'Amazon_MRP','Amazon FBA MRP':'Amazon_FBA_MRP', 'Flipkart MRP':'Flipkart_MRP', 'Limeroad MRP':'Limeroad_MRP', 'Myntra MRP':'Myntra_MRP','Paytm MRP':'Paytm_MRP', 'Snapdeal MRP':'Snapdeal_MRP', 'Custom_Size':'Size'}, inplace=True)
pl_marzo.head()

,id,Sku,style,Catalog,categoria,Weight,TP_1,TP_2,MRP_Old,Final_MRP_Old,Ajio_MRP,Amazon_MRP,Amazon_FBA_MRP,Flipkart_MRP,Limeroad_MRP,Myntra_MRP,Paytm_MRP,Snapdeal_MRP,Size
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,S
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,M
2,2,Os206_3141_L,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,L
3,3,Os206_3141_XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,XL
4,4,Os206_3141_2XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,2XL

<h3>Se hace la creacion de la tabla pl_marzo</h3>

In [41]:
%sql CREATE TABLE `pl_marzo` (	`id` INT(11) NULL DEFAULT NULL,	`Sku` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`style` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`Catalog` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`categoria` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`Weight` DECIMAL(20,6) NULL DEFAULT NULL,	`TP_1` DECIMAL(20,6) NULL DEFAULT NULL,	`TP_2` DECIMAL(20,6) NULL DEFAULT NULL,	`MRP_Old` DECIMAL(20,6) NULL DEFAULT NULL,	`Final_MRP_Old` DECIMAL(20,6) NULL DEFAULT NULL,	`Ajio_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Amazon_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Amazon_FBA_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Flipkart_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Limeroad_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Myntra_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Paytm_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Snapdeal_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Size` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	UNIQUE (`Sku`) USING BTREE)

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'tfm_alex.pl_marzo' doesn't exist
[SQL: select * from pl_marzo limit 5]
(Background on this error at: https://sqlalche.me/e/20/f405)

<p>Se visualiza los 5 primeros datos para visualizar si se creo correctamente la tabla en la base de datos</p>

In [43]:
%sql select * from pl_marzo limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<h3>Ejecutamos la funcion para poder realizar la inserción de datos</h3>

In [45]:
pl_marzo.to_sql('pl_marzo', con = conn, if_exists = 'append', index=False)

1221

<p>Ejecutamos nuevamente la query para visualizar los datos que se ingresaron y validar que se realizo de manera correcta.</p>

In [46]:
%sql select * from pl_marzo limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[(0, 'Os206_3141_S', 'Os206_3141', 'Moments', 'Kurta', Decimal('0.300000'), Decimal('538.000000'), Decimal('435.780000'), Decimal('2178.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), 'S'),
 (1, 'Os206_3141_M', 'Os206_3141', 'Moments', 'Kurta', Decimal('0.300000'), Decimal('538.000000'), Decimal('435.780000'), Decimal('2178.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), 'M'),
 (2, 'Os206_3141_L', 'Os206_3141', 'Moments', 'Kurta', Decimal('0.300000'), Decimal('538.000000'), Decimal('435.780000'), Decimal('2178.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), 'L'),
 (3, 'Os206_3141_XL', 'Os206_3141', 'Moments', 'Kurta', Decimal('0.300000'), Decimal('538.000000'), Decimal('435.780000'), Decimal('2178.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), 'XL'),
 (4, 'Os206_3141_2XL', 'Os206_3141', 'Moments', 'Kurta', Decimal('0.300000'), Decimal('538.000000'), Decimal('435.780000'), Decimal('2178.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), Decimal('2295.000000'), '2XL')]

## 5. Importación de archivo Sale Report

In [47]:
sale_report = pd.read_csv("./Data Set/sales_report_clean.csv")
sale_report.head()

   Unnamed: 0       SKU Code Design Code  Stock       Category Size Color
0           0    AN201-RED-L       AN201    5.0  AN : LEGGINGS    L   Red
1           1    AN201-RED-M       AN201    5.0  AN : LEGGINGS    M   Red
2           2    AN201-RED-S       AN201    3.0  AN : LEGGINGS    S   Red
3           3   AN201-RED-XL       AN201    6.0  AN : LEGGINGS   XL   Red
4           4  AN201-RED-XXL       AN201    3.0  AN : LEGGINGS  XXL   Red

<p>Visualizamos las columnas que continee este documento</p>

In [48]:
sale_report.columns

Index(['Unnamed: 0', 'SKU Code', 'Design Code', 'Stock', 'Category', 'Size',
       'Color'],
      dtype='object')

<h3>Hacemos el actualizado del nombre de las columnas para poder ingresar a la DB correctamente</h3>

In [49]:
sale_report.rename(columns={'Unnamed: 0':'id', 'SKU Code':'Sku', 'Design Code':'Style'}, inplace=True)
sale_report.head()

   id            Sku  Style  Stock       Category Size Color
0   0    AN201-RED-L  AN201    5.0  AN : LEGGINGS    L   Red
1   1    AN201-RED-M  AN201    5.0  AN : LEGGINGS    M   Red
2   2    AN201-RED-S  AN201    3.0  AN : LEGGINGS    S   Red
3   3   AN201-RED-XL  AN201    6.0  AN : LEGGINGS   XL   Red
4   4  AN201-RED-XXL  AN201    3.0  AN : LEGGINGS  XXL   Red

<h3>Hacemos la creacion de la tabla sale_report para que inrgesemos sus datos debidamente</h3>

In [51]:
%sql CREATE TABLE `sale_report` (	`id` INT(11) NULL DEFAULT NULL,	`Sku` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Style` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Stock` DECIMAL(20,2) NULL DEFAULT NULL,	`Category` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Size` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Color` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',UNIQUE (`id`) USING BTREE)

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<p>Visualizamos que se creo la tabla correctamente</p>

In [52]:
%sql select * from sale_report

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<h3>Ejecutamos la query para ingresar los datos que corresponden.</h3>

In [53]:
sale_report.to_sql('sale_report', con = conn, if_exists = 'append', index=False)

9188

<p>Visualizamos que se creo la tabla correctamente con los datos ingresados.</p>

In [54]:
%sql select * from sale_report limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[(0, 'AN201-RED-L', 'AN201', Decimal('5.00'), 'AN : LEGGINGS', 'L', 'Red'),
 (1, 'AN201-RED-M', 'AN201', Decimal('5.00'), 'AN : LEGGINGS', 'M', 'Red'),
 (2, 'AN201-RED-S', 'AN201', Decimal('3.00'), 'AN : LEGGINGS', 'S', 'Red'),
 (3, 'AN201-RED-XL', 'AN201', Decimal('6.00'), 'AN : LEGGINGS', 'XL', 'Red'),
 (4, 'AN201-RED-XXL', 'AN201', Decimal('3.00'), 'AN : LEGGINGS', 'XXL', 'Red')]

## 6. Crear listado de SKU

<p>Hacemos la carga de los archivos </p>
<ul>
<li>Amazon</li>
<li>International</li>
<li>PL March</li>
<li>Sales Report</li>
</ul>

In [55]:
amazon_clean_sku = pd.read_csv("./Data Set/amazon_final.csv")
international_sku = pd.read_csv("./Data Set/02 International sale Report_1_clean.csv")
pl_marzo_sku = pd.read_excel("./Data Set/P_L_MARCH_CLEAN.xlsx")
sale_report_sku = pd.read_csv("./Data Set/sales_report_clean.csv")

<h3> Del archivo amazon</h3>
<p>Eliminamos los campos que no requerimos para la inseriona a la DB</p>

In [57]:
amazon_clean_sku.drop(['index', 'Order ID', 'Date', 'Status', 'Fulfilment', 'Sales Channel ',
       'ship-service-level', 'ASIN',
       'Courier Status', 'Qty', 'currency', 'Amount', 'ship-state',
       'ship-postal-code', 'ship-country', 'B2B', 'fulfilled-by',
       'sub-status'],axis = 'columns', inplace=True)
amazon_clean_sku.head()

     Style              SKU       Category Size
0   SET389   SET389-KR-NP-S            Set    S
1  JNE3781  JNE3781-KR-XXXL          kurta  3XL
2  JNE3371    JNE3371-KR-XL          kurta   XL
3    J0341       J0341-DR-L  Western Dress    L
4  JNE3671  JNE3671-TU-XXXL            Top  3XL

In [58]:
amazon_clean_sku = amazon_clean_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
amazon_clean_sku

                    SKU    Style       Category Size  Color
0        SET389-KR-NP-S   SET389            Set    S    NaN
1       JNE3781-KR-XXXL  JNE3781          kurta  3XL    NaN
2         JNE3371-KR-XL  JNE3371          kurta   XL    NaN
3            J0341-DR-L    J0341  Western Dress    L    NaN
4       JNE3671-TU-XXXL  JNE3671            Top  3XL    NaN
...                 ...      ...            ...  ...    ...
128970    JNE3697-KR-XL  JNE3697          kurta   XL    NaN
128971   SET401-KR-NP-M   SET401            Set    M    NaN
128972     J0157-DR-XXL    J0157  Western Dress  XXL    NaN
128973     J0012-SKD-XS    J0012            Set   XS    NaN
128974      J0003-SET-S    J0003            Set    S    NaN

[128975 rows x 5 columns]

<p>Creamos el nuevo archivo con los datos nuevos</p>

In [59]:
ruta_csv = "./SKU/sku_amazon.csv"
amazon_clean_sku.to_csv(ruta_csv, index=False)

<p>Visualizamos los datos que continene International</p>

In [60]:
international_sku.head()

,index,DATE,Months,CUSTOMER,Style,SKU,Size,PCS,RATE,GROSS AMT
0,0,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-L,L,1.0,616.56,617.0
1,1,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XL,XL,1.0,616.56,617.0
2,2,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XXL,XXL,1.0,616.56,617.0
3,3,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5009,MEN5009-KR-L,L,1.0,616.56,617.0
4,4,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5011,MEN5011-KR-L,L,1.0,616.56,617.0

<h3>Hacemos limpieza de los campos que no requerimos </h3>

In [61]:
international_sku.drop(['index','DATE','Months','CUSTOMER','PCS','RATE','GROSS AMT'],axis = 'columns', inplace=True)
international_sku.head()

     Style             SKU Size
0  MEN5004    MEN5004-KR-L    L
1  MEN5004   MEN5004-KR-XL   XL
2  MEN5004  MEN5004-KR-XXL  XXL
3  MEN5009    MEN5009-KR-L    L
4  MEN5011    MEN5011-KR-L    L

<h3>Actualizamos el indice de la tabla a ingresar.</h3>

In [62]:
international_sku = international_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
international_sku

                   SKU     Style  Category Size  Color
0         MEN5004-KR-L   MEN5004       NaN    L    NaN
1        MEN5004-KR-XL   MEN5004       NaN   XL    NaN
2       MEN5004-KR-XXL   MEN5004       NaN  XXL    NaN
3         MEN5009-KR-L   MEN5009       NaN    L    NaN
4         MEN5011-KR-L   MEN5011       NaN    L    NaN
...                ...       ...       ...  ...    ...
17213   SET276-KR-PP-L    SET276       NaN    L    NaN
17214  PJNE3423-KR-4XL  PJNE3423       NaN  4XL    NaN
17215  PJNE3404-KR-4XL  PJNE3404       NaN  4XL    NaN
17216  PJNE3423-KR-4XL  PJNE3423       NaN  4XL    NaN
17217  SET290-KR-DPT-M    SET290       NaN    M    NaN

[17218 rows x 5 columns]

<p>Guardamos los datos en un nuevo archivo</p>

In [64]:
ruta_csv = "./SKU/sku_international.csv"
international_sku.to_csv(ruta_csv, index=False)

In [65]:
pl_marzo_sku.head()

,index,Sku,Style Id,Catalog,Category,Weight,TP 1,TP 2,MRP Old,Final MRP Old,Ajio MRP,Amazon MRP,Amazon FBA MRP,Flipkart MRP,Limeroad MRP,Myntra MRP,Paytm MRP,Snapdeal MRP,Custom_Size
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,S
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,M
2,2,Os206_3141_L,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,L
3,3,Os206_3141_XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,XL
4,4,Os206_3141_2XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,2XL

<h3>Visualizamos los datos del documento plmarzo </h3>

In [66]:
pl_marzo_sku.columns

Index(['index', 'Sku', 'Style Id', 'Catalog', 'Category', 'Weight', 'TP 1',
       'TP 2', 'MRP Old', 'Final MRP Old', 'Ajio MRP', 'Amazon MRP',
       'Amazon FBA MRP', 'Flipkart MRP', 'Limeroad MRP', 'Myntra MRP',
       'Paytm MRP', 'Snapdeal MRP', 'Custom_Size'],
      dtype='object')

<p>Eliminamos campos que no utilizaremos</p>

In [67]:
pl_marzo_sku.drop([ 'index', 'Catalog',  'Weight', 'TP 1',
       'TP 2', 'MRP Old', 'Final MRP Old', 'Ajio MRP', 'Amazon MRP',
       'Amazon FBA MRP', 'Flipkart MRP', 'Limeroad MRP', 'Myntra MRP',
       'Paytm MRP', 'Snapdeal MRP'],axis = 'columns', inplace=True)
pl_marzo_sku.head()

              Sku    Style Id Category Custom_Size
0    Os206_3141_S  Os206_3141    Kurta           S
1    Os206_3141_M  Os206_3141    Kurta           M
2    Os206_3141_L  Os206_3141    Kurta           L
3   Os206_3141_XL  Os206_3141    Kurta          XL
4  Os206_3141_2XL  Os206_3141    Kurta         2XL

In [68]:
pl_marzo_sku.rename(columns={'Sku':'SKU','Style Id':'Style','Custom_Size':'Size'}, inplace=True)
pl_marzo_sku.head()

              SKU       Style Category Size
0    Os206_3141_S  Os206_3141    Kurta    S
1    Os206_3141_M  Os206_3141    Kurta    M
2    Os206_3141_L  Os206_3141    Kurta    L
3   Os206_3141_XL  Os206_3141    Kurta   XL
4  Os206_3141_2XL  Os206_3141    Kurta  2XL

In [69]:
pl_marzo_sku = pl_marzo_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
pl_marzo_sku

                 SKU       Style Category Size  Color
0       Os206_3141_S  Os206_3141    Kurta    S    NaN
1       Os206_3141_M  Os206_3141    Kurta    M    NaN
2       Os206_3141_L  Os206_3141    Kurta    L    NaN
3      Os206_3141_XL  Os206_3141    Kurta   XL    NaN
4     Os206_3141_2XL  Os206_3141    Kurta  2XL    NaN
...              ...         ...      ...  ...    ...
1216         Os326_M       Os326    Kurta    M    NaN
1217         Os326_L       Os326    Kurta    L    NaN
1218        Os326_XL       Os326    Kurta   XL    NaN
1219       Os326_2XL       Os326    Kurta  2XL    NaN
1220       Os326_3XL       Os326    Kurta  3XL    NaN

[1221 rows x 5 columns]

<h3>Generamos el nuevo archivo con los datos previamente seleccionados.</h3>

In [70]:
ruta_csv = "./SKU/sku_marzo.csv"
pl_marzo_sku.to_csv(ruta_csv, index=False)

<h3>Verificamos la información del documento de sale report</h3>

In [71]:
sale_report_sku.head()

   Unnamed: 0       SKU Code Design Code  Stock       Category Size Color
0           0    AN201-RED-L       AN201    5.0  AN : LEGGINGS    L   Red
1           1    AN201-RED-M       AN201    5.0  AN : LEGGINGS    M   Red
2           2    AN201-RED-S       AN201    3.0  AN : LEGGINGS    S   Red
3           3   AN201-RED-XL       AN201    6.0  AN : LEGGINGS   XL   Red
4           4  AN201-RED-XXL       AN201    3.0  AN : LEGGINGS  XXL   Red

<h3>Actualizamos el nombre de los campos que contiene el documento</h3>

In [72]:
sale_report_sku.rename(columns={'Unnamed: 0':'id','SKU Code':'SKU','Design Code':'Style'}, inplace=True)
sale_report_sku.head()

   id            SKU  Style  Stock       Category Size Color
0   0    AN201-RED-L  AN201    5.0  AN : LEGGINGS    L   Red
1   1    AN201-RED-M  AN201    5.0  AN : LEGGINGS    M   Red
2   2    AN201-RED-S  AN201    3.0  AN : LEGGINGS    S   Red
3   3   AN201-RED-XL  AN201    6.0  AN : LEGGINGS   XL   Red
4   4  AN201-RED-XXL  AN201    3.0  AN : LEGGINGS  XXL   Red

<h3> Eliminamos los campos que no utilizaremos </h3>

In [73]:
sale_report_sku.drop([ 'id','Stock'],axis = 'columns', inplace=True)
sale_report_sku.head()

             SKU  Style       Category Size Color
0    AN201-RED-L  AN201  AN : LEGGINGS    L   Red
1    AN201-RED-M  AN201  AN : LEGGINGS    M   Red
2    AN201-RED-S  AN201  AN : LEGGINGS    S   Red
3   AN201-RED-XL  AN201  AN : LEGGINGS   XL   Red
4  AN201-RED-XXL  AN201  AN : LEGGINGS  XXL   Red

In [74]:
sale_report_sku = sale_report_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
sale_report_sku

                    SKU   Style       Category  Size Color
0           AN201-RED-L   AN201  AN : LEGGINGS     L   Red
1           AN201-RED-M   AN201  AN : LEGGINGS     M   Red
2           AN201-RED-S   AN201  AN : LEGGINGS     S   Red
3          AN201-RED-XL   AN201  AN : LEGGINGS    XL   Red
4         AN201-RED-XXL   AN201  AN : LEGGINGS   XXL   Red
...                 ...     ...            ...   ...   ...
9183     SET462-KR-NP-S  SET462            SET     S  Teal
9184    SET462-KR-NP-XL  SET462            SET    XL  Teal
9185    SET462-KR-NP-XS  SET462            SET    XS  Teal
9186   SET462-KR-NP-XXL  SET462            SET   XXL  Teal
9187  SET462-KR-NP-XXXL  SET462            SET  XXXL  Teal

[9188 rows x 5 columns]

<h3>Generamos el nuevo documento en base a los datos limpios</h3>

In [75]:
ruta_csv = "./SKU/sku_sale_report.csv"
sale_report_sku.to_csv(ruta_csv, index=False)

<h3>Hacemos la creacion del nuevo dataframe con la informacion de los 4 ultimos documentos realizados.</h3>

<p>Generamos el nuevo dataframe</p>

In [77]:
import os
# Ruta de la carpeta que contiene los archivos CSV
carpeta = './SKU'

# Lista para almacenar los DataFrames de cada archivo CSV
dataframes = []

# Itera sobre cada archivo en la carpeta
for archivo in os.listdir(carpeta):
    if archivo.endswith('.csv'):
        # Construye la ruta completa del archivo
        ruta_completa = os.path.join(carpeta, archivo)
        
        # Lee el archivo CSV y lo agrega a la lista
        df = pd.read_csv(ruta_completa)
        dataframes.append(df)

# Combina todos los DataFrames en uno solo
df_final = pd.concat(dataframes, ignore_index=True)

# Muestra el DataFrame resultante
print(df_final)

                   SKU    Style Category Size Color
0         MEN5004-KR-L  MEN5004      NaN    L   NaN
1        MEN5004-KR-XL  MEN5004      NaN   XL   NaN
2       MEN5004-KR-XXL  MEN5004      NaN  XXL   NaN
3         MEN5009-KR-L  MEN5009      NaN    L   NaN
4         MEN5011-KR-L  MEN5011      NaN    L   NaN
...                ...      ...      ...  ...   ...
156597         Os326_M    Os326    Kurta    M   NaN
156598         Os326_L    Os326    Kurta    L   NaN
156599        Os326_XL    Os326    Kurta   XL   NaN
156600       Os326_2XL    Os326    Kurta  2XL   NaN
156601       Os326_3XL    Os326    Kurta  3XL   NaN

[156602 rows x 5 columns]

In [78]:
df_final.tail()

              SKU  Style Category Size Color
156597    Os326_M  Os326    Kurta    M   NaN
156598    Os326_L  Os326    Kurta    L   NaN
156599   Os326_XL  Os326    Kurta   XL   NaN
156600  Os326_2XL  Os326    Kurta  2XL   NaN
156601  Os326_3XL  Os326    Kurta  3XL   NaN

In [79]:
df_final.shape

(156602, 5)

<h3>Eliminamos datos duplicados.</h3>

In [80]:
df_final = df.drop_duplicates(subset=["SKU"])

df_final.shape

(1221, 5)

<h3>Creamos la nueva tabla para la información de SKU</h3>

In [81]:
%sql CREATE TABLE `sku` (	`SKU` CHAR(50) NOT NULL DEFAULT '' COLLATE 'utf8_spanish_ci',	`Style` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Category` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Size` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Color` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	PRIMARY KEY (`SKU`) USING BTREE)

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
0 rows affected.

[]

<h3>Hacemos el ingreso de los datos para la tabla SKU</h3>

In [82]:
df_final.to_sql('sku', con = conn, if_exists = 'append', index=False)

1221

<h3>Visualizamos que los datos se ingresaron y la tabla se creo correctamente.</h3>

In [83]:
%sql select * from sku limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[('Os102_14255_2XL', 'Os102_14255', 'Kurta', '2XL', None),
 ('Os102_14255_3XL', 'Os102_14255', 'Kurta', '3XL', None),
 ('Os102_14255_L', 'Os102_14255', 'Kurta', 'L', None),
 ('Os102_14255_M', 'Os102_14255', 'Kurta', 'M', None),
 ('Os102_14255_S', 'Os102_14255', 'Kurta', 'S', None)]

## Nuevas tablas apartir de Amazon

In [15]:
dim_logistic = amazon_clean.copy()
dim_productos = amazon_clean.copy()
facts = amazon_clean.copy()

<h3>Crearemos la tabla </h3>
<ul>
<li>Dim Logistic</li> <li>Dim Productos</li><li>Facts</li> </ul>

<h4>Creamos el campo order_id_sku uniendo el orderId y SKU separados por los campos -000-</h4>

In [17]:
dim_logistic['order_id_sku'] = dim_logistic['order_id'] + '-000-'+dim_logistic['SKU']

In [18]:
dim_logistic.columns

Index(['index', 'order_id', 'Date', 'estado', 'Fulfilment', 'Sales_channel',
       'ship_service_level', 'Style', 'SKU', 'Category', 'Size', 'ASIN',
       'Courier_Status', 'Qty', 'currency', 'Amount', 'ship_state',
       'ship_postal_code', 'ship_country', 'B2B', 'fulfilled_by', 'sub_status',
       'order_id_sku'],
      dtype='object')

<h3>Retiramos los campos que no utilizaremos </h3>

In [19]:
dim_logistic.drop(['index', 'Date', 'estado', 
       'ship_service_level', 'Style', 'Category', 'Size',
'Qty', 'currency', 'Amount'
],axis = 'columns', inplace=True)

In [22]:
dim_logistic.columns

Index(['order_id', 'Fulfilment', 'Sales_channel', 'SKU', 'ASIN',
       'Courier_Status', 'ship_postal_code', 'B2B', 'fulfilled_by',
       'sub_status', 'order_id_sku'],
      dtype='object')

<h3>Creamos la tabla DIM Logistic</h3>

In [21]:
dim_logistic.to_sql('dim_logistic', con = conn, if_exists = 'append', index=False)

128975

<h3>Se verifica que se ingresaron los datos y la tabla se creo correctamente</h3>

In [23]:
%sql select * from dim_logistic limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[('405-8078784-5731545', 'Merchant', 'Amazon.in', 'SET389-KR-NP-S', 'B09KXVBD7Z', None, 400081.0, 0, 'Easy Ship', None, '405-8078784-5731545-000-SET389-KR-NP-S'),
 ('171-9198151-1101146', 'Merchant', 'Amazon.in', 'JNE3781-KR-XXXL', 'B09K3WFS32', 'Shipped', 560085.0, 0, 'Easy Ship', 'Delivered to Buyer', '171-9198151-1101146-000-JNE3781-KR-XXXL'),
 ('404-0687676-7273146', 'Amazon', 'Amazon.in', 'JNE3371-KR-XL', 'B07WV4JV4D', 'Shipped', 410210.0, 1, None, None, '404-0687676-7273146-000-JNE3371-KR-XL'),
 ('403-9615377-8133951', 'Merchant', 'Amazon.in', 'J0341-DR-L', 'B099NRCT7B', None, 605008.0, 0, 'Easy Ship', None, '403-9615377-8133951-000-J0341-DR-L'),
 ('407-1069790-7240320', 'Amazon', 'Amazon.in', 'JNE3671-TU-XXXL', 'B098714BZP', 'Shipped', 600073.0, 0, None, None, '407-1069790-7240320-000-JNE3671-TU-XXXL')]

<h3>Hacemos la limpieza de los datos necesarios para crear DIM PRODUCTOS</h3>

In [25]:
dim_productos.drop(['index', 'Date', 'estado', 'Fulfilment', 'Sales_channel',
       'ship_service_level', 'ASIN',
       'Courier_Status', 'Qty', 'currency', 'Amount', 'ship_state',
       'ship_postal_code', 'ship_country', 'B2B', 'fulfilled_by', 'sub_status',
       ],axis = 'columns', inplace=True)

<h3>Creamos la tabla y se efectua la inserción de datos para la tabla DIM PRODUCTOS</h3>

In [26]:
dim_productos.to_sql('dim_productos', con = conn, if_exists = 'append', index=False)

128975

<h3>Se verifica que se ingresaron los datos y la tabla se creo correctamente</h3>

In [27]:
%sql select * from dim_productos limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[('SET389', 'SET389-KR-NP-S', 'Set', 'S'),
 ('JNE3781', 'JNE3781-KR-XXXL', 'kurta', '3XL'),
 ('JNE3371', 'JNE3371-KR-XL', 'kurta', 'XL'),
 ('J0341', 'J0341-DR-L', 'Western Dress', 'L'),
 ('JNE3671', 'JNE3671-TU-XXXL', 'Top', '3XL')]

In [28]:
facts['order_id_sku'] = facts['order_id'] + '-000-'+facts['SKU']

<h3>Se elimina los campos que no sean necesarios</h3>

In [29]:
facts.drop(['index',  'Fulfilment', 'Sales_channel',
       'ship_service_level', 'Style', 'Category', 'Size', 'ASIN',
       'Courier_Status', 'currency', 'ship_state',
       'ship_postal_code', 'ship_country', 'B2B', 'fulfilled_by', 'sub_status',
       ],axis = 'columns', inplace=True)

<h3>Se ejecuta la creación de la tabla y el ingreso de los datos</h3>

In [30]:
facts.to_sql('facts', con = conn, if_exists = 'append', index=False)

128975

<h3>Se verifica que se ingresaron los datos y la tabla se creo correctamente</h3>

In [31]:
%sql select * from facts limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
5 rows affected.

[('2022-04-30', 'Cancelled', 'SET389-KR-NP-S', 0, 647.62, '405-8078784-5731545-000-SET389-KR-NP-S'),
 ('2022-04-30', 'Shipped', 'JNE3781-KR-XXXL', 1, 406.0, '171-9198151-1101146-000-JNE3781-KR-XXXL'),
 ('2022-04-30', 'Shipped', 'JNE3371-KR-XL', 1, 329.0, '404-0687676-7273146-000-JNE3371-KR-XL'),
 ('2022-04-30', 'Cancelled', 'J0341-DR-L', 0, 753.33, '403-9615377-8133951-000-J0341-DR-L'),
 ('2022-04-30', 'Shipped', 'JNE3671-TU-XXXL', 1, 574.0, '407-1069790-7240320-000-JNE3671-TU-XXXL')]

###  se agrega Cloud warehouse

In [8]:
cloud_warehouse = pd.read_excel("./Data Set/Clean_Cloud Warehouse Compersion Chart.xlsx")
cloud_warehouse.head()

                              Heads  Shiprocket(Rs./Unit)  INCREFF(Rs./Unit)
0     Inbound (Fresh Stock and RTO)                     4                  4
1                          Outbound                     7                 11
2                   Storage Fee/Cft                    25  Rs 0.15/- Per Day
3  Customer Return with Detailed QC                     6               15.5

<h3>Se crea la tabla e inserta los datos</h3>

In [9]:
cloud_warehouse.to_sql(name='CLOUD_WAREHOUSE_COMPERSION',con=conn,if_exists = 'append', index=False)
print('Se ingresaron todos los datos del CSV CLOUD_WAREHOUSE_COMPERSION.....')

Se ingresaron todos los datos del CSV CLOUD_WAREHOUSE_COMPERSION.....

/var/folders/qp/15r6t82j457fsqn4ys0brpmh0000gp/T/ipykernel_98894/2611917628.py:1: UserWarning: The provided table name 'CLOUD_WAREHOUSE_COMPERSION' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  cloud_warehouse.to_sql(name='CLOUD_WAREHOUSE_COMPERSION',con=conn,if_exists = 'append', index=False)

<h3>Se verifica que se ingresaron los datos y la tabla se creo correctamente</h3>

In [10]:
%sql select * from CLOUD_WAREHOUSE_COMPERSION limit 5

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
4 rows affected.

[('Inbound (Fresh Stock and RTO)', 4, '4'),
 ('Outbound', 7, '11'),
 ('Storage Fee/Cft', 25, 'Rs 0.15/- Per Day'),
 ('Customer Return with Detailed QC', 6, '15.5')]

<h3>Verificamos que las tablas existen</h3>

In [11]:
%sql show tables

 * mysql+mysqlconnector://inesdiadmin:***@inesditfm.mysql.database.azure.com:3306/tfm_alex?ssl_ca=.%2Fcert.pem
10 rows affected.

[('amazon_sales_report',),
 ('cloud_warehouse_compersion',),
 ('dim_logistic',),
 ('dim_productos',),
 ('facts',),
 ('international_sale_report',),
 ('pl_marzo',),
 ('sale_report',),
 ('sku',),
 ('stock',)]

<h4>Terminar conexion a base de datos</h4>

con el query se culmina la conexion a sql

In [12]:
cursor.close()